# IFC_DelRecFromObjMap

## Description
Deletes Record from Object's mapping.

```pascal
FUNCTION IFC_DelRecFromObjMap(
				objectName : STRING;
				recordName : STRING): BOOLEAN;
```

```python
def vs.IFC_DelRecFromObjMap(objectName, recordName):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|objectName|STRING|   |
|recordName|STRING|   |

## Version
Availability: from Vectorworks 2023.4

## Category
* IFC